package com.example

object setData {

    fun getQuestion(): ArrayList<QuestionData> {

        var que: ArrayList<QuestionData> = arrayListOf()

        var q1 = QuestionData(
            1,
            "صِلَةُ الخَيَالِ عَلَى الْبِعادِ لِقَاء     ُلَوْ كانَ يَمْلِكُ عَيْنِيَ الإغْفَاءُ\n\n" +
                    "يا هاجرِي مِنْ غَيْرِ ذَنبٍ في الْهَوَى    مَهْلا، فَهَجْرُكَ والمنُونُ سَواءُ\n\n" +
                    "أَغْرَيْتَ لَحْظَكَ بالْفُؤادِ فَشَفَّه    وَمِنَ الْعُيونِ عَلَى النُّفُوس بَلاءُ\n\n" +
                    "هِيَ نَظْرَةٌ، فامْنُنْ عَلَيَّ بِأُخْتِها    فالْخَمْرُ مِنْ ألَمِ الْخُمارِ شِفَاءُ \n\n" +
                    "ميز  اللون البياني  في الشطر الأول من البيت الأول : ",
            "استعارة مكنية",
            "استعارة تصريحية",
            "تشبيه بليغ",
            "مجاز مرسل",
            3

        )

        var q2 = QuestionData(
            2,
            "صِلَةُ الخَيَالِ عَلَى الْبِعادِ لِقَاء     ُلَوْ كانَ يَمْلِكُ عَيْنِيَ الإغْفَاءُ\n\n" +
                    "يا هاجرِي مِنْ غَيْرِ ذَنبٍ في الْهَوَى    مَهْلا، فَهَجْرُكَ والمنُونُ سَواءُ\n\n" +
                    "أَغْرَيْتَ لَحْظَكَ بالْفُؤادِ فَشَفَّه    وَمِنَ الْعُيونِ عَلَى النُّفُوس بَلاءُ\n\n" +
                    "هِيَ نَظْرَةٌ، فامْنُنْ عَلَيَّ بِأُخْتِها    فالْخَمْرُ مِنْ ألَمِ الْخُمارِ شِفَاءُ \n\n" +
                    "ميز المحسن البديعي في البيت الرابع : ",
            "مقابلة",
            "جناس ناقص",
            "سجع",
            "تصريع",
            3

        )

        var q3 = QuestionData(
            3,
            "صِلَةُ الخَيَالِ عَلَى الْبِعادِ لِقَاء     ُلَوْ كانَ يَمْلِكُ عَيْنِيَ الإغْفَاءُ\n\n" +
                    "يا هاجرِي مِنْ غَيْرِ ذَنبٍ في الْهَوَى    مَهْلا، فَهَجْرُكَ والمنُونُ سَواءُ\n\n" +
                    "أَغْرَيْتَ لَحْظَكَ بالْفُؤادِ فَشَفَّه    وَمِنَ الْعُيونِ عَلَى النُّفُوس بَلاءُ\n\n" +
                    "هِيَ نَظْرَةٌ، فامْنُنْ عَلَيَّ بِأُخْتِها    فالْخَمْرُ مِنْ ألَمِ الْخُمارِ شِفَاءُ \n\n" +
                    "حدد العاطفة المسيطرة على الشاعر : ",
            "الحزن و الأسى",
            "الشوق والحنين",
            "الفخر والاعتزاز",
            "اليأس والتشاؤم",
            2

        )

        var q4 = QuestionData(
            4,
            "صِلَةُ الخَيَالِ عَلَى الْبِعادِ لِقَاء     ُلَوْ كانَ يَمْلِكُ عَيْنِيَ الإغْفَاءُ\n\n" +
                    "يا هاجرِي مِنْ غَيْرِ ذَنبٍ في الْهَوَى    مَهْلا، فَهَجْرُكَ والمنُونُ سَواءُ\n\n" +
                    "أَغْرَيْتَ لَحْظَكَ بالْفُؤادِ فَشَفَّه    وَمِنَ الْعُيونِ عَلَى النُّفُوس بَلاءُ\n\n" +
                    "هِيَ نَظْرَةٌ، فامْنُنْ عَلَيَّ بِأُخْتِها    فالْخَمْرُ مِنْ ألَمِ الْخُمارِ شِفَاءُ \n\n" +
                    "الغرض البلاغي من الأمر في  (فامْنُنْ عَلَيَّ بِأُخْتِها ) ",
            "التمني",
            "الالتماس",
            "التعجيز",
            "التوبيخ",
            2

        )

        var q5 = QuestionData(
            5,
            "صِلَةُ الخَيَالِ عَلَى الْبِعادِ لِقَاء     ُلَوْ كانَ يَمْلِكُ عَيْنِيَ الإغْفَاءُ\n\n" +
                    "يا هاجرِي مِنْ غَيْرِ ذَنبٍ في الْهَوَى    مَهْلا، فَهَجْرُكَ والمنُونُ سَواءُ\n\n" +
                    "أَغْرَيْتَ لَحْظَكَ بالْفُؤادِ فَشَفَّه    وَمِنَ الْعُيونِ عَلَى النُّفُوس بَلاءُ\n\n" +
                    "هِيَ نَظْرَةٌ، فامْنُنْ عَلَيَّ بِأُخْتِها    فالْخَمْرُ مِنْ ألَمِ الْخُمارِ شِفَاءُ \n\n" +
                    "ما الخيط الفكرى الواحد الذي  يربط الأبيات ؟ ",
            "مرارة الفراق",
            "هجر الأصدقاء",
            "الابتعاد عن الوطن",
            "ذكر مساوئ الاغتراب",
            1

        )

        var q6 = QuestionData(
            6,
            "فَــــلاَ تَعِــدِي مَـوَاعِـــدَ كاذِبــــــاتٍ    تَمُــــرُّ بِهــــا رِيــاحُ الصَّيْفِ دُونِـيُ\n\n" +
                    "فَـإِنِّـــي لــــو تُخـالِفُنِـــي شِمالِــــي    خِلاَفَـَــكِ ما وَصَلْــتُ بِهـــــا يَمِينِـيُ\n\n" +
                    "إِذاً لَقَطَعْتُــــهـا ولَقُلْـــــتُ بِـِينــــــي    كــذلِكَ أَجْتَـــوِى مَــــنْ يَجْتَوِينِـــــيُ\n\n" +
                    "لَعَـــلَّكِ إِنْ صَــرَمْـتِ الحَبْلَ مِنِّـي     كَــــذَاكِ أَكُـــــونُ مُصْحِبَتِي قَـَرُونِـيُ \n\n" +
                    "ميز  اللون البياني  في(تُخـالِفُنِـــي شِمالِــــي): ",
            "استعارة مكنية",
            "استعارة تصريحية",
            "تشبيه بليغ ",
            "مجاز مرسل ",
            1

        )

        var q7 = QuestionData(
            7,
            "فَــــلاَ تَعِــدِي مَـوَاعِـــدَ كاذِبــــــاتٍ    تَمُــــرُّ بِهــــا رِيــاحُ الصَّيْفِ دُونِـيُ\n\n" +
                    "فَـإِنِّـــي لــــو تُخـالِفُنِـــي شِمالِــــي    خِلاَفَـَــكِ ما وَصَلْــتُ بِهـــــا يَمِينِـيُ\n\n" +
                    "إِذاً لَقَطَعْتُــــهـا ولَقُلْـــــتُ بِـِينــــــي    كــذلِكَ أَجْتَـــوِى مَــــنْ يَجْتَوِينِـــــيُ\n\n" +
                    "لَعَـــلَّكِ إِنْ صَــرَمْـتِ الحَبْلَ مِنِّـي     كَــــذَاكِ أَكُـــــونُ مُصْحِبَتِي قَـَرُونِـيُ \n\n" +
                    "ميز المحسن البديعي في البيت ( تعدي ، مواعد ): ",
            "مقابلة",
            "جناس ناقص ",
            "سجع  ",
            "تصريع ",
            2

        )

        var q8 = QuestionData(
            8,
            "فَــــلاَ تَعِــدِي مَـوَاعِـــدَ كاذِبــــــاتٍ    تَمُــــرُّ بِهــــا رِيــاحُ الصَّيْفِ دُونِـيُ\n\n" +
                    "فَـإِنِّـــي لــــو تُخـالِفُنِـــي شِمالِــــي    خِلاَفَـَــكِ ما وَصَلْــتُ بِهـــــا يَمِينِـيُ\n\n" +
                    "إِذاً لَقَطَعْتُــــهـا ولَقُلْـــــتُ بِـِينــــــي    كــذلِكَ أَجْتَـــوِى مَــــنْ يَجْتَوِينِـــــيُ\n\n" +
                    "لَعَـــلَّكِ إِنْ صَــرَمْـتِ الحَبْلَ مِنِّـي     كَــــذَاكِ أَكُـــــونُ مُصْحِبَتِي قَـَرُونِـيُ \n\n" +
                    "حدد العاطفة المسيطرة على الشاعر : ",
            "الحزن والتحدي",
            "الأمل والاطمئنان ",
            "الفخر والاعتزاز ",
            "اليأس والتشاؤم ",
            1

        )

        var q9 = QuestionData(
            9,
            "فَــــلاَ تَعِــدِي مَـوَاعِـــدَ كاذِبــــــاتٍ    تَمُــــرُّ بِهــــا رِيــاحُ الصَّيْفِ دُونِـيُ\n\n" +
                    "فَـإِنِّـــي لــــو تُخـالِفُنِـــي شِمالِــــي    خِلاَفَـَــكِ ما وَصَلْــتُ بِهـــــا يَمِينِـيُ\n\n" +
                    "إِذاً لَقَطَعْتُــــهـا ولَقُلْـــــتُ بِـِينــــــي    كــذلِكَ أَجْتَـــوِى مَــــنْ يَجْتَوِينِـــــيُ\n\n" +
                    "لَعَـــلَّكِ إِنْ صَــرَمْـتِ الحَبْلَ مِنِّـي     كَــــذَاكِ أَكُـــــونُ مُصْحِبَتِي قَـَرُونِـيُ \n\n" +
                    "الغرض البلاغي من النهي في  (فَــــلاَ تَعِــدِي) ",
            "التمني",
            "الالتماس ",
            "التعجيز ",
            "التحذير ",
            4

        )

        var q10 = QuestionData(
            10,
            "فَــــلاَ تَعِــدِي مَـوَاعِـــدَ كاذِبــــــاتٍ    تَمُــــرُّ بِهــــا رِيــاحُ الصَّيْفِ دُونِـيُ\n\n" +
                    "فَـإِنِّـــي لــــو تُخـالِفُنِـــي شِمالِــــي    خِلاَفَـَــكِ ما وَصَلْــتُ بِهـــــا يَمِينِـيُ\n\n" +
                    "إِذاً لَقَطَعْتُــــهـا ولَقُلْـــــتُ بِـِينــــــي    كــذلِكَ أَجْتَـــوِى مَــــنْ يَجْتَوِينِـــــيُ\n\n" +
                    "لَعَـــلَّكِ إِنْ صَــرَمْـتِ الحَبْلَ مِنِّـي     كَــــذَاكِ أَكُـــــونُ مُصْحِبَتِي قَـَرُونِـيُ \n\n" +
                    "ما وسيلة القصر في (تمر بها رياح) ",
            "تعريف طرفي الجملة",
            "تقديم شبه الجملة ",
            "العطف بلا ",
            "النفي والاستثناء ",
            2

        )

        var q11 = QuestionData(
            11,
            "أطلَّت على سُحبِ الظلامِ ذُكاءٍُ    وفُجِّرَ من صخرِ التنُوفةِ مَاءُُ\n\n" +
                    "وخُبِّرت الأوثانُ أنَّ زمانَها    تولَّى، وراحَ الجهلُ والجهلاءُُ\n\n" +
                    "إفما سجدت إلَّا لذي العرشِ جبهةٌ    ولم يَرتفعْ إلَّا إليه دُعَاءُُ\n\n" +
                    "تبسَّم ثغرُ الصبحِ عن مولدِ الهُدى     فللأرضِ إشراقٌ به وزُهَاءُ \n\n" +
                    "ميز  اللون البياني  في(ذُكاءُ): ",
            "استعارة مكنية ",
            "استعارة تصريحية ",
            "تشبيه بليغ  ",
            "مجاز مرسل  ",
            2

        )

        var q12 = QuestionData(
            12,
            "أطلَّت على سُحبِ الظلامِ ذُكاءٍُ    وفُجِّرَ من صخرِ التنُوفةِ مَاءُُ\n\n" +
                    "وخُبِّرت الأوثانُ أنَّ زمانَها    تولَّى، وراحَ الجهلُ والجهلاءُُ\n\n" +
                    "إفما سجدت إلَّا لذي العرشِ جبهةٌ    ولم يَرتفعْ إلَّا إليه دُعَاءُُ\n\n" +
                    "تبسَّم ثغرُ الصبحِ عن مولدِ الهُدى     فللأرضِ إشراقٌ به وزُهَاءُ \n\n" +
                    "ميز المحسن البديعي في البيت (وراحَ الجهلُ والجهلاءُ): ",
            "مقابلة ",
            "جناس ناقص  ",
            "سجع  ",
            "تصريع   ",
            2

        )

        var q13 = QuestionData(
            13,
            "أطلَّت على سُحبِ الظلامِ ذُكاءٍُ    وفُجِّرَ من صخرِ التنُوفةِ مَاءُُ\n\n" +
                    "وخُبِّرت الأوثانُ أنَّ زمانَها    تولَّى، وراحَ الجهلُ والجهلاءُُ\n\n" +
                    "إفما سجدت إلَّا لذي العرشِ جبهةٌ    ولم يَرتفعْ إلَّا إليه دُعَاءُُ\n\n" +
                    "تبسَّم ثغرُ الصبحِ عن مولدِ الهُدى     فللأرضِ إشراقٌ به وزُهَاءُ \n\n" +
                    "حدد العاطفة المسيطرة على الشاعر : ",
            "الحزن والتحدي ",
            "الحب والتقدير  ",
            "الفخر والاعتزاز  ",
            "اليأس والتشاؤم   ",
            2

        )

        var q14 = QuestionData(
            14,
            "أطلَّت على سُحبِ الظلامِ ذُكاءٍُ    وفُجِّرَ من صخرِ التنُوفةِ مَاءُُ\n\n" +
                    "وخُبِّرت الأوثانُ أنَّ زمانَها    تولَّى، وراحَ الجهلُ والجهلاءُُ\n\n" +
                    "إفما سجدت إلَّا لذي العرشِ جبهةٌ    ولم يَرتفعْ إلَّا إليه دُعَاءُُ\n\n" +
                    "تبسَّم ثغرُ الصبحِ عن مولدِ الهُدى     فللأرضِ إشراقٌ به وزُهَاءُ \n\n" +
                    "الغرض البلاغي من النهي في  (فَــــلاَ تَعِــدِي) ",
            "التمني ",
            "الالتماس  ",
            "التعجيز  ",
            "التحذير   ",
            4

        )

        var q15 = QuestionData(
            15,
            "أطلَّت على سُحبِ الظلامِ ذُكاءٍُ    وفُجِّرَ من صخرِ التنُوفةِ مَاءُُ\n\n" +
                    "وخُبِّرت الأوثانُ أنَّ زمانَها    تولَّى، وراحَ الجهلُ والجهلاءُُ\n\n" +
                    "إفما سجدت إلَّا لذي العرشِ جبهةٌ    ولم يَرتفعْ إلَّا إليه دُعَاءُُ\n\n" +
                    "تبسَّم ثغرُ الصبحِ عن مولدِ الهُدى     فللأرضِ إشراقٌ به وزُهَاءُ \n\n" +
                    "ما وسيلة القصر في الشطر الأول من البيت الثالث. ",
            "تعريف طرفي الجملة ",
            "تقديم شبه الجملة ",
            "العطف بلا  ",
            "النفي والاستثناء   ",
            4

        )




        que.add(q1)
        que.add(q2)
        que.add(q3)
        que.add(q4)
        que.add(q5)
        que.add(q6)
        que.add(q7)
        que.add(q8)
        que.add(q9)
        que.add(q10)
        que.add(q11)
        que.add(q12)
        que.add(q13)
        que.add(q14)
        que.add(q15)

        return que
    }
}